:PROPERTIES:
:ID:       c79795f9-4953-4662-8177-a1d2151d62ba
:END:
#+TITLE: NixOS: Trying ROCm Tensorflow & JAX
#+CATEGORY: slips
#+TAGS:
#+PROPERTY: header-args:jupyter-python+ :kernel python3 :session /jpy::nixos_trying_rocm_tensorflow_jax
#+PROPERTY: header-args+ :var jpvol=(setq-local jpvol "/nb")
#+PROPERTY: header-args+ :var jpdir=(setq-local jpdir (expand-file-name (dc/org-roam-get-slug) jpvol))

* Tensorflow

#+begin_src jupyter-python :results output file :file "img/foo.png" :async t
import tensorflow as tf
print("TensorFlow version:", tf.__version__)

from tensorflow.keras.layers import Dense, Flatten, Conv2D
from tensorflow.keras import Model
#+end_src

#+begin_src jupyter-python :results output file :file "img/foo.png" :async t
gpus = tf.config.list_physical_devices('GPU')
if gpus:
  # Restrict TensorFlow to only allocate 1GB of memory on the first GPU
  try:
    tf.config.set_logical_device_configuration(
      gpus[0],
      [tf.config.LogicalDeviceConfiguration(memory_limit=1024)])
    logical_gpus = tf.config.list_logical_devices('GPU')
    print(len(gpus), "Physical GPUs,", len(logical_gpus), "Logical GPUs")
  except RuntimeError as e:
    # Virtual devices must be set before GPUs have been initialized
    print(e)
#+end_src

#+RESULTS:
: 1 Physical GPUs, 1 Logical GPUs
: WARNING: All log messages before absl::InitializeLog() is called are written to STDERR
: I0000 00:00:1767996340.596433      13 gpu_device.cc:2022] Created device /job:localhost/replica:0/task:0/device:GPU:0 with 1024 MB memory:  -> device: 0, name: AMD Radeon RX 6700 XT, pci bus id: 0000:0b:00.0

#+begin_src jupyter-python :results output file :file "img/foo.png" :async t

mnist = tf.keras.datasets.mnist

(x_train, y_train), (x_test, y_test) = mnist.load_data()
x_train, x_test = x_train / 255.0, x_test / 255.0
model = tf.keras.models.Sequential([
  tf.keras.layers.Flatten(input_shape=(28, 28)),
  tf.keras.layers.Dense(128, activation='relu'),
  tf.keras.layers.Dropout(0.2),
  tf.keras.layers.Dense(10)
])
predictions = model(x_train[:1]).numpy()
tf.nn.softmax(predictions).numpy()
loss_fn = tf.keras.losses.SparseCategoricalCrossentropy(from_logits=True)
loss_fn(y_train[:1], predictions).numpy()
model.compile(optimizer='adam',
              loss=loss_fn,
              metrics=['accuracy'])
model.fit(x_train, y_train, epochs=5)
model.evaluate(x_test,  y_test, verbose=2)
#+end_src

#+RESULTS:
#+begin_example
Downloading data from https://storage.googleapis.com/tensorflow/tf-keras-datasets/mnist.npz
/usr/local/lib/python3.12/site-packages/keras/src/layers/reshaping/flatten.py:37: UserWarning: Do not pass an `input_shape`/`input_dim` argument to a layer. When using Sequential models, prefer using an `Input(shape)` object as the first layer in the model instead.
  super().__init__(**kwargs)
Epoch 1/5
2026-01-09 22:06:31.458106: W external/local_xla/xla/tsl/framework/cpu_allocator_impl.cc:83] Allocation of 188160000 exceeds 10% of free system memory.
2026-01-09 22:06:31.707436: W external/local_xla/xla/tsl/framework/cpu_allocator_impl.cc:83] Allocation of 188160000 exceeds 10% of free system memory.
WARNING: All log messages before absl::InitializeLog() is called are written to STDERR
I0000 00:00:1767996392.202636     959 service.cc:148] XLA service 0x7f9d1c009770 initialized for platform ROCM (this does not guarantee that XLA will be used). Devices:
I0000 00:00:1767996392.202666     959 service.cc:156]   StreamExecutor device (0): AMD Radeon RX 6700 XT, AMDGPU ISA version: gfx1030
2026-01-09 22:06:32.214364: I tensorflow/compiler/mlir/tensorflow/utils/dump_mlir_util.cc:268] disabling MLIR crash reproducer, set env var `MLIR_CRASH_REPRODUCER_DIRECTORY` to enable.
Epoch 2/5
Epoch 3/5
Epoch 4/5
Epoch 5/5
313/313 - 2s - 5ms/step - accuracy: 0.9761 - loss: 0.0742
#+end_example


*** Images

#+name: imgtf
#+begin_src emacs-lisp
;; :noweb-ref imgtf
(format "rocm/tensorflow:rocm%s-py%s-tf%s-dev" vrocm vpython vtf)
#+end_src

#+RESULTS: imgtf
: rocm/tensorflow:rocm6.4.2-py3.12-tf2.18-dev

#+name: imgjax
#+begin_src emacs-lisp
;; :noweb-ref imgjax
(format "rocm/jax:rocm%s-jax%s-py3.12" vrocm vjax vpython)
#+end_src

#+RESULTS: imgjax
: rocm/jax:rocm6.4.2-jax0.4.35-py3.12

+ Taichi Lang on ROCm installation
  - fork rocm/taichi
+ [[https://yuanming.taichi.graphics/publication/2019-taichi/taichi-lang.pdf][Taichi: High-Perf Computation on Spatially Sparse Data Structures]]
  - lots of =@ti

#+name: imgtaichi
#+begin_src emacs-lisp
(format "rocm/taichi:taichi-%s_rocm%s_ubuntu22.04_py%s" "1.8.0b1" "6.3.2" "3.10.12")
#+end_src

#+RESULTS: imgtaichi
: rocm/taichi:taichi-1.8.0b1_rocm6.3.2_ubuntu22.04_py3.10.12

